In [1]:
import numpy as np

import pandas as pd

In [2]:
dict1={
    "name":['harry','John','akshay','shubham'],
    "marks":[30,40,50,60],
    "city":['Gaya','Texas','Banaras','Bareilly']
}

In [3]:
dict1

{'name': ['harry', 'John', 'akshay', 'shubham'],
 'marks': [30, 40, 50, 60],
 'city': ['Gaya', 'Texas', 'Banaras', 'Bareilly']}

In [4]:
pd

In [5]:
x=pd.DataFrame(dict1)
x

      name  marks      city
0    harry     30      Gaya
1     John     40     Texas
2   akshay     50   Banaras
3  shubham     60  Bareilly

# Q. What is pandas?
 * __Pandas is an open Sources data analysis library written in python.__
 * __It leverages the power and speed of numpy to make data analysis preprocessing easy for data scientiest.__
 * __It provides rich and highly robust data operations.__

# Pandas Data Structures

 * __Pandas has two types of data structure.__
 * __1. Series: It's one dimensional array with indexes, it store a single column or row of data in DataFrame.__
 * __2. DataFrame: It is tablular spreadsheet like structure representing rows each rows each of contains one or multiple columns.__

# Note:
 * __1. A One-Dimensional array(labeled) Capable of holding any type of data-Series.__
 * __2. A Two-Dimensional array(labeled) structures with columns of potentialally different types of data- DataFrame.__

In [6]:
ser=pd.Series(np.random.rand(40))

In [7]:
ser

0     0.049944
1     0.875320
2     0.096403
3     0.005707
4     0.041498
5     0.199860
6     0.738381
7     0.033847
8     0.720700
9     0.199893
10    0.919830
11    0.258387
12    0.914745
13    0.096753
14    0.453415
15    0.330858
16    0.583711
17    0.861809
18    0.719032
19    0.594424
20    0.210646
21    0.021664
22    0.109579
23    0.684001
24    0.515807
25    0.193094
26    0.574259
27    0.086835
28    0.316022
29    0.941421
30    0.227897
31    0.937555
32    0.262936
33    0.562949
34    0.583554
35    0.122052
36    0.254157
37    0.183695
38    0.819536
39    0.062871
dtype: float64

In [8]:
df

NameError: name 'df' is not defined

In [9]:
x

      name  marks      city
0    harry     30      Gaya
1     John     40     Texas
2   akshay     50   Banaras
3  shubham     60  Bareilly

In [10]:
df=pd.DataFrame(dict1)

In [11]:
# CSV= comma seperated value file.

df.to_csv('sample.csv')

# Remove Index Value

In [12]:
df=df.to_csv('sample_index_False.csv',index=False)

In [13]:
df

# head() function

In [14]:
df.head()   # name marks city ................................. .---------------,-------------,----------

AttributeError: 'NoneType' object has no attribute 'head'

# Describe() function

 * __For numeric data, the result's index will count, mean, std, min, max, as well as lower, 50 and upper percentiles. By default the lower percentile is 25 and the uppper percentile is 75. The 50 Percentile is the same as the median.__

In [15]:
df.describe()

AttributeError: 'NoneType' object has no attribute 'describe'

tail() function

In [16]:
df.tail()

AttributeError: 'NoneType' object has no attribute 'tail'

In [17]:
xyz=pd.read_csv('xyz.csv')

In [18]:
xyz

   Train No  Speed          City
0     12322     50          Pune
1     12547    200         Delhi
2    125654     55        Mumbai
3    563355     65  Indian Ocean
4    124563     23     antartica

In [19]:
x1=pd.read_csv('Final_Employees_Data.csv')

In [20]:
x1

,Eid,Ename,Experience,Total_projects,Rating,Area_of_Interest_1,Area_of_Interest_2,Area_of_Interest_3,Language1,Language2,Language3,AI_project_count,ML_project_count,JS_project_count,Java_project_count,DotNet_project_count,Mobile_project_count
0,1,Dana Bond,2,2,1.000000,DotNet,JS,AI,English,Hindi,Tamil,0,1,1,0,0,0
1,2,Jesus Hampton,9,13,1.444444,DotNet,AI,JS,English,Hindi,Malayalam,4,3,0,2,3,1
2,3,Teresa Munoz,15,16,1.066667,ML,JS,Java,English,Kannada,Chinese,3,3,1,3,5,1
3,4,Annette Dipietro,18,19,1.055556,DotNet,ML,Mobile,English,Chinese,Tamil,4,4,2,3,3,3
4,5,Jennifer Fortner,22,15,0.681818,Mobile,Java,JS,English,Chinese,Telugu,3,4,3,1,1,3
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
995,996,Nicole Meeks,24,27,1.125000,Java,Mobile,AI,English,Telugu,Tamil,11,3,2,6,4,1
996,997,Trista Cheek,3,6,2.000000,Mobile,ML,DotNet,English,Chinese,Telugu,1,0,2,1,2,0
997,998,Constance Rozier,14,5,0.357143,AI,ML,Mobile,English,Kannada,Telugu,2,1,1,1,0,0
998,999,Elizabeth Bannister,11,9,0.818182,JS,ML,DotNet,English,Tamil,Japenese,4,2,1,1,0,1
999,1000,Susan Weber,11,13,1.181818,ML,AI,JS,English,Telugu,Hindi,4,0,1,2,5,1

In [21]:
x1.head(10)

,Eid,Ename,Experience,Total_projects,Rating,Area_of_Interest_1,Area_of_Interest_2,Area_of_Interest_3,Language1,Language2,Language3,AI_project_count,ML_project_count,JS_project_count,Java_project_count,DotNet_project_count,Mobile_project_count
0,1,Dana Bond,2,2,1.000000,DotNet,JS,AI,English,Hindi,Tamil,0,1,1,0,0,0
1,2,Jesus Hampton,9,13,1.444444,DotNet,AI,JS,English,Hindi,Malayalam,4,3,0,2,3,1
2,3,Teresa Munoz,15,16,1.066667,ML,JS,Java,English,Kannada,Chinese,3,3,1,3,5,1
3,4,Annette Dipietro,18,19,1.055556,DotNet,ML,Mobile,English,Chinese,Tamil,4,4,2,3,3,3
4,5,Jennifer Fortner,22,15,0.681818,Mobile,Java,JS,English,Chinese,Telugu,3,4,3,1,1,3
5,6,Mary Todd,7,13,1.857143,AI,Java,ML,English,Chinese,Hindi,2,5,1,1,1,3
6,7,Nicolas Fulcher,2,2,1.000000,AI,Mobile,DotNet,English,Hindi,Telugu,1,0,1,0,0,0
7,8,Bernice Bousquet,3,4,1.333333,DotNet,Mobile,Java,English,Malayalam,Hindi,1,0,1,1,1,0
8,9,William Berger,2,5,2.500000,JS,DotNet,AI,English,Tamil,Malayalam,1,2,1,1,0,0
9,10,Kennith Hamilton,3,8,2.666667,Mobile,ML,JS,English,Kannada,Telugu,0,2,3,3,0,0

In [22]:
x1.tail(10)

,Eid,Ename,Experience,Total_projects,Rating,Area_of_Interest_1,Area_of_Interest_2,Area_of_Interest_3,Language1,Language2,Language3,AI_project_count,ML_project_count,JS_project_count,Java_project_count,DotNet_project_count,Mobile_project_count
990,991,Joan Takemura,5,7,1.400000,JS,AI,DotNet,English,Malayalam,Kannada,2,1,1,1,1,1
991,992,Stephen Burritt,19,19,1.000000,ML,Mobile,Java,English,Malayalam,Hindi,3,5,3,4,1,3
992,993,Virginia Hamby,13,12,0.923077,AI,DotNet,ML,English,Malayalam,Kannada,5,4,1,0,0,2
993,994,Joseph Buckner,19,26,1.368421,JS,AI,Java,English,Telugu,Chinese,2,5,7,2,6,4
994,995,Glenn Bumbrey,15,17,1.133333,ML,AI,Java,English,Kannada,Malayalam,3,4,2,3,2,3
995,996,Nicole Meeks,24,27,1.125000,Java,Mobile,AI,English,Telugu,Tamil,11,3,2,6,4,1
996,997,Trista Cheek,3,6,2.000000,Mobile,ML,DotNet,English,Chinese,Telugu,1,0,2,1,2,0
997,998,Constance Rozier,14,5,0.357143,AI,ML,Mobile,English,Kannada,Telugu,2,1,1,1,0,0
998,999,Elizabeth Bannister,11,9,0.818182,JS,ML,DotNet,English,Tamil,Japenese,4,2,1,1,0,1
999,1000,Susan Weber,11,13,1.181818,ML,AI,JS,English,Telugu,Hindi,4,0,1,2,5,1

In [23]:
x1.describe()

,Eid,Experience,Total_projects,Rating,AI_project_count,ML_project_count,JS_project_count,Java_project_count,DotNet_project_count,Mobile_project_count
count,1000.000000,1000.00000,1000.000000,1000.000000,1000.000000,1000.000000,1000.000000,1000.000000,1000.000000,1000.000000
mean,500.500000,12.79900,14.692000,1.293804,2.845000,2.574000,2.597000,2.409000,2.228000,2.039000
std,288.819436,6.68111,7.443288,0.622976,1.978608,1.894231,2.011128,1.980313,1.836134,1.790163
min,1.000000,2.00000,2.000000,0.357143,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000
25%,250.750000,7.00000,8.000000,0.869565,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000
50%,500.500000,13.00000,15.000000,1.166667,3.000000,2.000000,2.000000,2.000000,2.000000,2.000000
75%,750.250000,19.00000,20.000000,1.529412,4.000000,4.000000,4.000000,4.000000,4.000000,3.000000
max,1000.000000,24.00000,29.000000,4.500000,11.000000,10.000000,11.000000,12.000000,9.000000,11.000000

In [24]:
xyz

   Train No  Speed          City
0     12322     50          Pune
1     12547    200         Delhi
2    125654     55        Mumbai
3    563355     65  Indian Ocean
4    124563     23     antartica

In [25]:
xyz['Speed']

0     50
1    200
2     55
3     65
4     23
Name: Speed, dtype: int64

In [26]:
x1

,Eid,Ename,Experience,Total_projects,Rating,Area_of_Interest_1,Area_of_Interest_2,Area_of_Interest_3,Language1,Language2,Language3,AI_project_count,ML_project_count,JS_project_count,Java_project_count,DotNet_project_count,Mobile_project_count
0,1,Dana Bond,2,2,1.000000,DotNet,JS,AI,English,Hindi,Tamil,0,1,1,0,0,0
1,2,Jesus Hampton,9,13,1.444444,DotNet,AI,JS,English,Hindi,Malayalam,4,3,0,2,3,1
2,3,Teresa Munoz,15,16,1.066667,ML,JS,Java,English,Kannada,Chinese,3,3,1,3,5,1
3,4,Annette Dipietro,18,19,1.055556,DotNet,ML,Mobile,English,Chinese,Tamil,4,4,2,3,3,3
4,5,Jennifer Fortner,22,15,0.681818,Mobile,Java,JS,English,Chinese,Telugu,3,4,3,1,1,3
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
995,996,Nicole Meeks,24,27,1.125000,Java,Mobile,AI,English,Telugu,Tamil,11,3,2,6,4,1
996,997,Trista Cheek,3,6,2.000000,Mobile,ML,DotNet,English,Chinese,Telugu,1,0,2,1,2,0
997,998,Constance Rozier,14,5,0.357143,AI,ML,Mobile,English,Kannada,Telugu,2,1,1,1,0,0
998,999,Elizabeth Bannister,11,9,0.818182,JS,ML,DotNet,English,Tamil,Japenese,4,2,1,1,0,1
999,1000,Susan Weber,11,13,1.181818,ML,AI,JS,English,Telugu,Hindi,4,0,1,2,5,1

In [27]:
x1['Rating']

0      1.000000
1      1.444444
2      1.066667
3      1.055556
4      0.681818
         ...
995    1.125000
996    2.000000
997    0.357143
998    0.818182
999    1.181818
Name: Rating, Length: 1000, dtype: float64

In [28]:
xyz['Speed'][0]=50

C:\Users\Admin\AppData\Local\Temp\ipykernel_11152\311203616.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  xyz['Speed'][0]=50

In [29]:
xyz

   Train No  Speed          City
0     12322     50          Pune
1     12547    200         Delhi
2    125654     55        Mumbai
3    563355     65  Indian Ocean
4    124563     23     antartica

In [30]:
xyz['Speed'][1]=200

C:\Users\Admin\AppData\Local\Temp\ipykernel_11152\1573162637.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  xyz['Speed'][1]=200

In [31]:
xyz

   Train No  Speed          City
0     12322     50          Pune
1     12547    200         Delhi
2    125654     55        Mumbai
3    563355     65  Indian Ocean
4    124563     23     antartica

In [32]:
xyz['City'][0]='Pune'

C:\Users\Admin\AppData\Local\Temp\ipykernel_11152\2316205668.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  xyz['City'][0]='Pune'

In [33]:
xyz

   Train No  Speed          City
0     12322     50          Pune
1     12547    200         Delhi
2    125654     55        Mumbai
3    563355     65  Indian Ocean
4    124563     23     antartica

In [34]:
xyz['City'][2]='Mumbai'

C:\Users\Admin\AppData\Local\Temp\ipykernel_11152\462731291.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  xyz['City'][2]='Mumbai'

In [35]:
xyz

   Train No  Speed          City
0     12322     50          Pune
1     12547    200         Delhi
2    125654     55        Mumbai
3    563355     65  Indian Ocean
4    124563     23     antartica

In [36]:
xyz.to_csv('xyz.csv')

In [37]:
xyz.to_csv('xyz.csv',index=False)

In [38]:
xyz

   Train No  Speed          City
0     12322     50          Pune
1     12547    200         Delhi
2    125654     55        Mumbai
3    563355     65  Indian Ocean
4    124563     23     antartica

In [39]:
x1

,Eid,Ename,Experience,Total_projects,Rating,Area_of_Interest_1,Area_of_Interest_2,Area_of_Interest_3,Language1,Language2,Language3,AI_project_count,ML_project_count,JS_project_count,Java_project_count,DotNet_project_count,Mobile_project_count
0,1,Dana Bond,2,2,1.000000,DotNet,JS,AI,English,Hindi,Tamil,0,1,1,0,0,0
1,2,Jesus Hampton,9,13,1.444444,DotNet,AI,JS,English,Hindi,Malayalam,4,3,0,2,3,1
2,3,Teresa Munoz,15,16,1.066667,ML,JS,Java,English,Kannada,Chinese,3,3,1,3,5,1
3,4,Annette Dipietro,18,19,1.055556,DotNet,ML,Mobile,English,Chinese,Tamil,4,4,2,3,3,3
4,5,Jennifer Fortner,22,15,0.681818,Mobile,Java,JS,English,Chinese,Telugu,3,4,3,1,1,3
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
995,996,Nicole Meeks,24,27,1.125000,Java,Mobile,AI,English,Telugu,Tamil,11,3,2,6,4,1
996,997,Trista Cheek,3,6,2.000000,Mobile,ML,DotNet,English,Chinese,Telugu,1,0,2,1,2,0
997,998,Constance Rozier,14,5,0.357143,AI,ML,Mobile,English,Kannada,Telugu,2,1,1,1,0,0
998,999,Elizabeth Bannister,11,9,0.818182,JS,ML,DotNet,English,Tamil,Japenese,4,2,1,1,0,1
999,1000,Susan Weber,11,13,1.181818,ML,AI,JS,English,Telugu,Hindi,4,0,1,2,5,1

In [40]:
# Check the index value of your data.
x1.index

RangeIndex(start=0, stop=1000, step=1)

In [41]:
# Check the column value in your data.

x1.columns

Index(['Eid', 'Ename', 'Experience', 'Total_projects', 'Rating',
       'Area_of_Interest_1', 'Area_of_Interest_2', 'Area_of_Interest_3',
       'Language1', 'Language2', 'Language3', 'AI_project_count',
       'ML_project_count', 'JS_project_count', 'Java_project_count',
       'DotNet_project_count', 'Mobile_project_count'],
      dtype='object')

In [42]:
xyz.index

RangeIndex(start=0, stop=5, step=1)

In [43]:
xyz.columns

Index(['Train No', 'Speed', 'City'], dtype='object')

In [44]:
# How to convert numpy array
xyz.to_numpy()

array([[12322, 50, 'Pune'],
       [12547, 200, 'Delhi'],
       [125654, 55, 'Mumbai'],
       [563355, 65, 'Indian Ocean'],
       [124563, 23, 'antartica']], dtype=object)

In [45]:
x1.to_numpy()

array([[1, 'Dana Bond', 2, ..., 0, 0, 0],
       [2, 'Jesus Hampton', 9, ..., 2, 3, 1],
       [3, 'Teresa Munoz', 15, ..., 3, 5, 1],
       ...,
       [998, 'Constance Rozier', 14, ..., 1, 0, 0],
       [999, 'Elizabeth Bannister', 11, ..., 1, 0, 1],
       [1000, 'Susan Weber', 11, ..., 2, 5, 1]], dtype=object)

In [46]:
xyz

   Train No  Speed          City
0     12322     50          Pune
1     12547    200         Delhi
2    125654     55        Mumbai
3    563355     65  Indian Ocean
4    124563     23     antartica

In [47]:
xyz.T

              0      1       2             3          4
Train No  12322  12547  125654        563355     124563
Speed        50    200      55            65         23
City       Pune  Delhi  Mumbai  Indian Ocean  antartica

In [48]:
xyz.head(2)

   Train No  Speed   City
0     12322     50   Pune
1     12547    200  Delhi

In [49]:
x1

,Eid,Ename,Experience,Total_projects,Rating,Area_of_Interest_1,Area_of_Interest_2,Area_of_Interest_3,Language1,Language2,Language3,AI_project_count,ML_project_count,JS_project_count,Java_project_count,DotNet_project_count,Mobile_project_count
0,1,Dana Bond,2,2,1.000000,DotNet,JS,AI,English,Hindi,Tamil,0,1,1,0,0,0
1,2,Jesus Hampton,9,13,1.444444,DotNet,AI,JS,English,Hindi,Malayalam,4,3,0,2,3,1
2,3,Teresa Munoz,15,16,1.066667,ML,JS,Java,English,Kannada,Chinese,3,3,1,3,5,1
3,4,Annette Dipietro,18,19,1.055556,DotNet,ML,Mobile,English,Chinese,Tamil,4,4,2,3,3,3
4,5,Jennifer Fortner,22,15,0.681818,Mobile,Java,JS,English,Chinese,Telugu,3,4,3,1,1,3
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
995,996,Nicole Meeks,24,27,1.125000,Java,Mobile,AI,English,Telugu,Tamil,11,3,2,6,4,1
996,997,Trista Cheek,3,6,2.000000,Mobile,ML,DotNet,English,Chinese,Telugu,1,0,2,1,2,0
997,998,Constance Rozier,14,5,0.357143,AI,ML,Mobile,English,Kannada,Telugu,2,1,1,1,0,0
998,999,Elizabeth Bannister,11,9,0.818182,JS,ML,DotNet,English,Tamil,Japenese,4,2,1,1,0,1
999,1000,Susan Weber,11,13,1.181818,ML,AI,JS,English,Telugu,Hindi,4,0,1,2,5,1

In [50]:
# Sorting DataFrame by axis=0(Rows) and axis=1(Columns)

xyz.sort_index(axis=0,ascending=False)   # Descending

   Train No  Speed          City
4    124563     23     antartica
3    563355     65  Indian Ocean
2    125654     55        Mumbai
1     12547    200         Delhi
0     12322     50          Pune

In [51]:
xyz

   Train No  Speed          City
0     12322     50          Pune
1     12547    200         Delhi
2    125654     55        Mumbai
3    563355     65  Indian Ocean
4    124563     23     antartica

In [52]:
type(xyz['Train No'][2])

numpy.int64

In [53]:
xyz['Train No'][4]=123.20

C:\Users\Admin\AppData\Local\Temp\ipykernel_11152\3451755649.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  xyz['Train No'][4]=123.20
C:\Users\Admin\AppData\Local\Temp\ipykernel_11152\3451755649.py:1: FutureWarning: Setting an item of incompatible dtype is deprecated and will raise in a future error of pandas. Value '123.2' has dtype incompatible with int64, please explicitly cast to a compatible dtype first.
  xyz['Train No'][4]=123.20

In [54]:
xyz

   Train No  Speed          City
0   12322.0     50          Pune
1   12547.0    200         Delhi
2  125654.0     55        Mumbai
3  563355.0     65  Indian Ocean
4     123.2     23     antartica

In [55]:
type(xyz['Train No'][4])

numpy.float64

In [56]:
type(xyz['Speed'][3])

numpy.int64

In [57]:
# Setting with copy warning. 

newdf2=xyz

In [58]:
newdf2['Train No']

0     12322.0
1     12547.0
2    125654.0
3    563355.0
4       123.2
Name: Train No, dtype: float64

In [59]:
newdf2

   Train No  Speed          City
0   12322.0     50          Pune
1   12547.0    200         Delhi
2  125654.0     55        Mumbai
3  563355.0     65  Indian Ocean
4     123.2     23     antartica

In [60]:
newdf2['Train No'][0]=400

In [61]:
newdf2

   Train No  Speed          City
0     400.0     50          Pune
1   12547.0    200         Delhi
2  125654.0     55        Mumbai
3  563355.0     65  Indian Ocean
4     123.2     23     antartica

In [62]:
xyz

   Train No  Speed          City
0     400.0     50          Pune
1   12547.0    200         Delhi
2  125654.0     55        Mumbai
3  563355.0     65  Indian Ocean
4     123.2     23     antartica

In [63]:
y=xyz.copy()

In [64]:
y

   Train No  Speed          City
0     400.0     50          Pune
1   12547.0    200         Delhi
2  125654.0     55        Mumbai
3  563355.0     65  Indian Ocean
4     123.2     23     antartica

In [65]:
y['Speed'][0]=100

C:\Users\Admin\AppData\Local\Temp\ipykernel_11152\1973865409.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  y['Speed'][0]=100

In [66]:
y

   Train No  Speed          City
0     400.0    100          Pune
1   12547.0    200         Delhi
2  125654.0     55        Mumbai
3  563355.0     65  Indian Ocean
4     123.2     23     antartica

In [67]:
xyz

   Train No  Speed          City
0     400.0     50          Pune
1   12547.0    200         Delhi
2  125654.0     55        Mumbai
3  563355.0     65  Indian Ocean
4     123.2     23     antartica

In [68]:
xyz

   Train No  Speed          City
0     400.0     50          Pune
1   12547.0    200         Delhi
2  125654.0     55        Mumbai
3  563355.0     65  Indian Ocean
4     123.2     23     antartica

In [69]:
z1=xyz['Speed'][3]=500

C:\Users\Admin\AppData\Local\Temp\ipykernel_11152\2421104499.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  z1=xyz['Speed'][3]=500

In [70]:
z1

500

In [71]:
xyz

   Train No  Speed          City
0     400.0     50          Pune
1   12547.0    200         Delhi
2  125654.0     55        Mumbai
3  563355.0    500  Indian Ocean
4     123.2     23     antartica

In [72]:
z1

500

In [73]:
z1=xyz

In [74]:
z1

   Train No  Speed          City
0     400.0     50          Pune
1   12547.0    200         Delhi
2  125654.0     55        Mumbai
3  563355.0    500  Indian Ocean
4     123.2     23     antartica

In [75]:
xyz

   Train No  Speed          City
0     400.0     50          Pune
1   12547.0    200         Delhi
2  125654.0     55        Mumbai
3  563355.0    500  Indian Ocean
4     123.2     23     antartica

In [76]:
# Access a group of rows and column by labels(s) or a boolean array.

In [77]:
xyz

   Train No  Speed          City
0     400.0     50          Pune
1   12547.0    200         Delhi
2  125654.0     55        Mumbai
3  563355.0    500  Indian Ocean
4     123.2     23     antartica

In [78]:
xyz

   Train No  Speed          City
0     400.0     50          Pune
1   12547.0    200         Delhi
2  125654.0     55        Mumbai
3  563355.0    500  Indian Ocean
4     123.2     23     antartica

In [79]:
xyz

   Train No  Speed          City
0     400.0     50          Pune
1   12547.0    200         Delhi
2  125654.0     55        Mumbai
3  563355.0    500  Indian Ocean
4     123.2     23     antartica

In [80]:
xyz.loc[0,0]=654

In [81]:
xyz

   Train No  Speed          City      0
0     400.0     50          Pune  654.0
1   12547.0    200         Delhi    NaN
2  125654.0     55        Mumbai    NaN
3  563355.0    500  Indian Ocean    NaN
4     123.2     23     antartica    NaN

In [82]:
xyz.loc[0,1]=100

In [83]:
xyz

   Train No  Speed          City      0      1
0     400.0     50          Pune  654.0  100.0
1   12547.0    200         Delhi    NaN    NaN
2  125654.0     55        Mumbai    NaN    NaN
3  563355.0    500  Indian Ocean    NaN    NaN
4     123.2     23     antartica    NaN    NaN

In [84]:
newdf3=xyz.copy()

In [85]:
newdf3

   Train No  Speed          City      0      1
0     400.0     50          Pune  654.0  100.0
1   12547.0    200         Delhi    NaN    NaN
2  125654.0     55        Mumbai    NaN    NaN
3  563355.0    500  Indian Ocean    NaN    NaN
4     123.2     23     antartica    NaN    NaN

In [86]:
newdf3.loc[0,0]=600

In [87]:
newdf3

   Train No  Speed          City      0      1
0     400.0     50          Pune  600.0  100.0
1   12547.0    200         Delhi    NaN    NaN
2  125654.0     55        Mumbai    NaN    NaN
3  563355.0    500  Indian Ocean    NaN    NaN
4     123.2     23     antartica    NaN    NaN